AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннуитетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дифференцированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПроцентнойСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыПроцентнойСтавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяПроцентнаяСтавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлавающаяПроцентнаяСтавкаЗависимаяОтСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлавающаяПроцентнаяСтавкаЗависимаяОтСрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПериодичностьПроцентнойСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПериодичностьПроцентнойСтавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПериодичностьСрокаЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьСрокаЗайма</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПогашенияЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыПогашенияЗаймов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равномерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуОкончанияДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПрограммыРасчетаЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПрограммыРасчетаЗайма</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьСтавкуШтрафа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяПрограмма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбщегоМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_ДеньПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_ПослеПлановогоПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадатьПорядокГашения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроценты_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСрокаЗайма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьСрокаЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодичностей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПогашенияЗаймов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазнесенияПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРазнесенияПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаПокаНачисляютсяПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаПокаНачисляютсяПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаПослеНачисленияПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаПослеНачисленияПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаНаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаНаПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНачисленияПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазаНачисленияПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритерийНаличияПросрочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КритерийНаличияПросрочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автопролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАвтопролонгаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяПрограмма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокГашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гашение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РасчетныеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыПроцентнойСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнтервалОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РасчетЗадолженностиМФО_Переопределяемый/Ext/Module.bsl
Процедура СоздатьНаСервере(ДОСсылка) Экспорт

	Договор = Документы.ДоговорМикрозайма.СоздатьДокумент();
	Договор.Дата = ТекущаяДатаСеанса();
	Договор.Займ = ДОСсылка;
	Договор.ПрограммаРасчета = Справочники.ПрограммыРасчетаЗайма.НайтиПоКоду("000000001");
	Договор.ДатаВыдачиЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0063     ");
	Договор.ДатаДоговора = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0061     ");
	Договор.ДатаПогашения = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0079     ");
	Договор.Срок = (Договор.ДатаПогашения - Договор.ДатаВыдачиЗайма) / 3600 / 24;

	Договор.СуммаВыданногоЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0062     ");
	Договор.ПроцентнаяСтавка = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0064     ");
	Договор.ВидПлатежа = Перечисления.ВидыПлатежей.Дифференцированный;
	Договор.ВидПроцентнойСтавки = Перечисления.ВидыПроцентнойСтавки.ФиксированнаяПроцентнаяСтавка;
	Договор.НомерДоговора = ДОСсылка.Наименование;
	Договор.ПериодичностьПроцентнойСтавки = Перечисления.ПериодичностьПроцентнойСтавки.День;
	Договор.ПериодичностьСрокаЗайма = Перечисления.ПериодичностьСрокаЗайма.День;
	Договор.КоличествоПериодичностей = 1;
	Договор.СпособПогашения = Перечисления.СпособыПогашенияЗаймов.НаДатуОкончанияДоговора;
	
	Список = РасчетЗадолженностиМФО.РассчитатьСписокПлатежей(Договор);
	График = РасчетЗадолженностиМФО.РассчитатьГрафикПлановыхПогашений(Договор, Список);	
	Для Каждого стр Из График Цикл
		стрТаб = Договор.ГрафикПлатежей.Добавить();
		ЗаполнитьЗначенияСвойств(стрТаб, стр);
	КонецЦикла;
	
	//Лебедева: Если загружены остатки на Дату цессии, раскомментировать
	
	//Договор.УчитыватьОстаткиНаДатуЦессии = Истина;

	//ЗаполнитьОстатки(Договор, ДОСсылка);
	Договор.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Договор.Займ, Договор.ДатаВыдачиЗайма);

КонецПроцедуры

Процедура ЗаполнитьОстатки(Договор, ДО)	
	Договор.ОстаткиДата = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0052     ");
	Договор.ОстаткиОсновнойДолг = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0053     ");
	Договор.ОстаткиПросроченныеПроценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0054     ");
	//Договор.ОстаткиПроценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0054     ");
	//Какие проценты вы по факту загружаете  в ДО в рекв 54, по умолчанию это скорее всего просроченные проценты
	Договор.ОстаткиШтрафы = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0055     ");
	Договор.ОстаткиПени = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0056     ");
	Договор.ДниПросрочки  = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0087     ");
	Договор.ОстаткиСумма = Договор.ОстаткиОсновнойДолг + Договор.ОстаткиПросроченныеПроценты + Договор.ОстаткиПроценты + Договор.ОстаткиШтрафы + Договор.ОстаткиПени;
КонецПроцедуры

Процедура СоздатьДоговорМикрозаймаПриЗаписи(Источник, Отказ) Экспорт
	Если РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(Источник.Ссылка, ТекущаяДатаСеанса()) = Неопределено Тогда
		СоздатьНаСервере(Источник.Ссылка);
		РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Источник.Ссылка, ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры
	
Функция ПолучитьСписокМикрозаймов() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДолговыеОбязательства.Ссылка КАК Займ
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(&ТекущаяДата) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |		ПО ОбъектыВРаботеОстатки.Объект = ДолговыеОбязательства.Ссылка");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ПроизводитьРасчетыПоДанномуДолговомуОбязательству(ДО) Экспорт
	Возврат Истина;	
КонецФункции
